Public Attributes | List of all members
API_ImportIdMappingType Struct Reference
Analytical Model
Describes the connection between the (un)segmented surface segments and the created member's edges and vertices. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
 API_ImportMappingTable  | edges
The mapping between edge's partID and the Surface Element Member Part Reference.
 API_ImportMappingTable  | vertices
The mapping between vertex's partID and the Surface Element Member Part Reference.
Detailed Description
Describes the connection between the (un)segmented surface segments and the created member's edges and vertices.
Since
Archicad 24